pythonic.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Oct 31, 2021 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Exploiting the features of Python to write code that is clean, concise and maintainable.</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Burak Demirtas">
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='https://code.cdn.mozilla.net/fonts/fira.css'>
<link rel='stylesheet' href='/css/site.css?v=2' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class='intro'>
  <h1>
    <span class="black">Burak Demirtas</span>
  </h1>
  <p>Software developer</p>
</div>

<div class='nav'>
<ul>
<li><a href='/'>Blog</a>.</li>
<li><a href='http://github.com/bdemirtas'>GitHub</a>.</li>
<li><a href='/index.xml'>RSS</a>.</li>
<li><a href='/about/'>About</a></li>
</ul>
</div>
</header>
<main id="content">
<header>
<h1 class="title">Exploiting the features of Python to write code that is clean, concise and maintainable.</h1>
</header>
<section id="outline-container-org6bbb697" class="outline-2">
<h2 id="org6bbb697">Pythonic</h2>
<div class="outline-text-2" id="text-org6bbb697">
<p>
Writing code isn&rsquo;t hard but writing code that is clean, concise, and maintainable that follows the convention of the Python community is harder. They are a lot of different ways to implement the same function, class, or feature.
Some of them are clean, sometimes confusing, or really bad writing that is hard to understand what it does exactly but in the end, the goal is to have a code that follows and naturally flows more in Python conventions and good practices.
That is the kind of code we want to write or wish often when we work and are satisfied at the end of the day with our work.
That&rsquo;s what I&rsquo;m going to try to help to write pythonic code and some python mechanics that can be very helpful.
</p>
</div>
</section>

<section id="outline-container-org36048a0" class="outline-2">
<h2 id="org36048a0">Context Managers</h2>
<div class="outline-text-2" id="text-org36048a0">
<p>
In other languages like Java or Ruby, it&rsquo;s common to use <code>def/ensure</code> or <code>try/finally</code> to acquire a lock on a resource and free it later if exceptions occur. Python has the <code>try/except</code> but there&rsquo;s a better way to do it.
As an example, I&rsquo;m going to use a virus scanner pyclamd to scan a file.
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">bad</span>
<span class="org-keyword">try</span>:
    <span class="org-variable-name">virus_scanner</span> = pyclamd.ClamdUnixSocket()
<span class="org-keyword">except</span> pyclamd.pyclamd.<span class="org-type">ConnectionError</span> <span class="org-keyword">as</span> msg:
    logger.error(f<span class="org-string">"Error while trying to scan the file"</span>)

<span class="org-variable-name">result</span> = virus_scanner.scan_file(path)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">VirusScan</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__enter__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.clamd = clamd.ClamdUnixSocket()
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__exit__</span>(<span class="org-keyword">self</span>, exc_type, exc_val, exc_tb):
        <span class="org-keyword">if</span> exc_type == clamd.<span class="org-type">ConnectionError</span>:
            <span class="org-keyword">print</span>(<span class="org-string">"No virus scanner found"</span>)
        <span class="org-keyword">else</span>:
            <span class="org-keyword">self</span>.clamd._close_socket()

    <span class="org-keyword">def</span> <span class="org-function-name">scan_files</span>(<span class="org-keyword">self</span>, path):
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.clamd.scan(path)

<span class="org-keyword">with</span> VirusScan() <span class="org-keyword">as</span> virus_sanner:
    <span class="org-variable-name">results</span> = virus_scanner.scan_files(<span class="org-string">"/tmp"</span>)
    <span class="org-keyword">for</span> <span class="org-builtin">file</span> <span class="org-keyword">in</span> results:
        <span class="org-keyword">print</span>(<span class="org-builtin">file</span>)
</pre>
</div>
<p>
Code above shows the usage of what is called in Python <b>With Statement Context Managers</b> that defines the entry and the exit from.
By encapsulating the virus scanner in class and defining the <code>__enter_~_ and ~__exit__</code> methods, the object can be used with the statement
that will open and close a connection to the virus scanner without adding extra code but also avoid using unnecessarily a <code>try/except</code> statement.
</p>
</div>
</section>

<section id="outline-container-orgdf0ec79" class="outline-2">
<h2 id="orgdf0ec79">Slicing</h2>
<div class="outline-text-2" id="text-orgdf0ec79">
<p>
In the previous code, the virus scanner return a dictionary with the file name as key and tuple as value with other information about the scanned file.
Getting the data isn&rsquo;t clean, simple, and can be confusing for developers if they aren&rsquo;t familiar with the pyclamd tuple structure. There&rsquo;s a simple way to
transform the return data structure to be more pythonic and easier to manipulate.
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">VirusScan</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__enter__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.clamd = clamd.ClamdUnixSocket()
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__exit__</span>(<span class="org-keyword">self</span>, exc_type, exc_val, exc_tb):
        <span class="org-keyword">if</span> exc_type == clamd.<span class="org-type">ConnectionError</span>:
            <span class="org-keyword">print</span>(<span class="org-string">"No virus scanner found"</span>)
        <span class="org-keyword">else</span>:
            <span class="org-keyword">self</span>.clamd._close_socket()

    <span class="org-keyword">def</span> <span class="org-function-name">scan_files</span>(<span class="org-keyword">self</span>, path):
        <span class="org-variable-name">result</span> = <span class="org-keyword">self</span>.clamd.scan(path)
        <span class="org-keyword">return</span> VirusScanFiles(result)


<span class="org-keyword">class</span> <span class="org-type">VirusScanFiles</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, result):
        <span class="org-variable-name">results</span> = [
            VirusScanFileStatus(filename=k, reason=v[1], status=v[0])
            <span class="org-keyword">for</span> k, v <span class="org-keyword">in</span> result.items()
            ]
        <span class="org-keyword">self</span>.results = results

    <span class="org-keyword">def</span> <span class="org-function-name">__len__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-builtin">len</span>(<span class="org-keyword">self</span>.results)

    <span class="org-keyword">def</span> <span class="org-function-name">__getitem__</span>(<span class="org-keyword">self</span>, index):
        <span class="org-keyword">if</span> index &gt;= <span class="org-builtin">len</span>(<span class="org-keyword">self</span>):
            <span class="org-keyword">raise</span> <span class="org-type">IndexError</span>
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.results[index]


<span class="org-type">@dataclass</span>
<span class="org-keyword">class</span> <span class="org-type">VirusScanFileStatus</span>:
    filename: <span class="org-builtin">str</span>
    reason: <span class="org-builtin">str</span>
    status: <span class="org-builtin">str</span>

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> == <span class="org-string">"__main__"</span>:
    <span class="org-keyword">with</span> VirusScan() <span class="org-keyword">as</span> virus_scanner:
        <span class="org-keyword">for</span> result <span class="org-keyword">in</span> virus_scanner.scan_files(<span class="org-string">"/tmp"</span>):
            <span class="org-keyword">print</span>(result)

</pre>
</div>
<p>
Code above shows the <code>VirusScan</code> object returns an instance of <code>VirusScanFiles</code> that contain the files dictionary and transform it into a list of object <code>VirusScanFileStatus</code> with the file data. By defining <code>__len__</code> and <code>__getitem</code> methods,
it becomes possible to loop through the instance without requiring the results. Also, the <code>VirusScanFiles</code> encapsulate the file data that is much easier to access and readable than returning a tuple. Not only this code respect follows the good practices and be more pythonic but it&rsquo;s now much much easier to write unit tests.
</p>
</div>
</section>

<section id="outline-container-org53d797b" class="outline-2">
<h2 id="org53d797b">Conclusion</h2>
<div class="outline-text-2" id="text-org53d797b">
<p>
I recommend using those tips in your python code and of course, there&rsquo;s much more different way to make your code more Pythonic.
However, making a code more pythonic doesn&rsquo;t mean it fits for you what&rsquo;s works for me. Use the python idioms to make your code readable
, concise and not just because it&rsquo;s Pythonic it&rsquo;s necessarily good, the end goal is to use python features to improve your code.</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2021 <a href='mailto:burak@kodpanik.com'>Burak Demirtas</a><br>
  Last updated on Oct 31, 2021. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.4.6).
</div>
</footer>
</body>
</html>
